# coding:iso-8859-9 Türkçe
# p_21502.py: 3 büyüyen diski 7 hamlede çivi1'den çivi3'e aktarmayı resmetme örneği.

def H (n, ç1, ç2, ç3): # Hanoi kulesi...
    global sayaç
    print ("H:", n, ç1, ç2, ç3, sep="")
    if n > 0:
        H (n - 1, ç1, ç3, ç2)
        if ç1[0]:
            disk = ç1[0].pop()
            print ("==>taşı disk:" + str(disk) + "'i " + ç1[1] + "'den " + ç3[1] + "'e.")
            ç3[0].append (disk)
        H (n - 1, ç2, ç1, ç3)
        sayaç +=1

sayaç = 0
ç1 = ([3,2,1], "ç1")
ç3 = ([], "ç3")
ç2 = ([], "ç2")
print ("İlk:", ç1, ç2, ç3, "\n")
H (len (ç1[0]), ç1, ç2, ç3)
print ("\nSon: ", ç1, " ", ç2, " ", ç3, " Hamle:2^", len(ç3), "-1=", sayaç, sep="")



"""Çıktı:
>python p_21502.py
İlk: ([3, 2, 1], 'ç1') ([], 'ç2') ([], 'ç3')

H:3([3, 2, 1], 'ç1')([], 'ç2')([], 'ç3')
H:2([3, 2, 1], 'ç1')([], 'ç3')([], 'ç2')
H:1([3, 2, 1], 'ç1')([], 'ç2')([], 'ç3')
H:0([3, 2, 1], 'ç1')([], 'ç3')([], 'ç2')
==>taşı disk:1'i ç1'den ç3'e.
H:0([], 'ç2')([3, 2], 'ç1')([1], 'ç3')
==>taşı disk:2'i ç1'den ç2'e.
H:1([1], 'ç3')([3], 'ç1')([2], 'ç2')
H:0([1], 'ç3')([2], 'ç2')([3], 'ç1')
==>taşı disk:1'i ç3'den ç2'e.
H:0([3], 'ç1')([], 'ç3')([2, 1], 'ç2')
==>taşı disk:3'i ç1'den ç3'e.
H:2([2, 1], 'ç2')([], 'ç1')([3], 'ç3')
H:1([2, 1], 'ç2')([3], 'ç3')([], 'ç1')
H:0([2, 1], 'ç2')([], 'ç1')([3], 'ç3')
==>taşı disk:1'i ç2'den ç1'e.
H:0([3], 'ç3')([2], 'ç2')([1], 'ç1')
==>taşı disk:2'i ç2'den ç3'e.
H:1([1], 'ç1')([], 'ç2')([3, 2], 'ç3')
H:0([1], 'ç1')([3, 2], 'ç3')([], 'ç2')
==>taşı disk:1'i ç1'den ç3'e.
H:0([], 'ç2')([], 'ç1')([3, 2, 1], 'ç3')

Son: ([], 'ç1') ([], 'ç2') ([3, 2, 1], 'ç3') Hamle:2^2-1=7
"""