# coding:iso-8859-9 Türkçe
# p_30303c.py: numpy.genfromtxt/loadtxt ile disk csv dosyasından ülkeler tablosunu ekrana yansıtma örneği.

import numpy as np

dt = np.dtype ([('avrupaÜlkesi', np.unicode, 20), ('nüfusYoğunluğu', 'i4'), ('km2Alanı', 'i4'), ('nüfusu', 'i4')])
x1 = np.genfromtxt ("p_30303bx.csv", dtype=dt, delimiter=";")

print (x1)
print ("_"*50)
#-----------------------------------------------------------------------------------------------

x2 = np.loadtxt ("p_30303bx.csv", dtype=dt, delimiter=";") # np.genfromtxt ile aynı...

print (x2)
print ("_"*50)
#-----------------------------------------------------------------------------------------------

for i in range (len (x2)): print (x2 [i])
print ("_"*53)
#-----------------------------------------------------------------------------------------------

print ("\n{:16s} {:10s} {:9s} {:6s}\n{:s}" .format ("Ülkeler", "Nüfusu", "Yüzölçümü", "NüfusYoğunluğu", "-"*52) )
for i in range (len (x2)): print ("{:16s} {:10,d} {:9,d} {:6.2f}" .format (x2 [i] [0], x2 [i] [3], x2 [i] [2], (x2 [i] [3] / x2 [i] [2])) )
print ("-"*52)



"""Çıktı:
>python p_30303c.py
[('Hollanda', 393,  41526, 16928800) ('Belçika', 337,  30510, 11007020)
 ('Birleşik Krallık', 256, 243610, 62262000)
 ('Almanya', 233, 357021, 81799600)
 ('Leh Cumhuriyeti', 205,    160,    32842)
 ('İtalya', 192, 301230, 59715625) ('İsviçre', 177,  41290,  7301994)
 ('Lüksemburg', 173,   2586,   512000) ('Fransa', 111, 547030, 63601002)
 ('Avusturya',  97,  83858,  8169929)
 ('Yunanistan',  81, 131940, 11606813) ('İrlanda',  65,  70280,  4581269)
 ('İsveç',  20, 449964,  9515744) ('Finlandiya',  16, 338424,  5410233)
 ('Norveç',  13, 385252,  5033675)]
__________________________________________________
[('Hollanda', 393,  41526, 16928800) ('Belçika', 337,  30510, 11007020)
 ('Birleşik Krallık', 256, 243610, 62262000)
 ('Almanya', 233, 357021, 81799600)
 ('Leh Cumhuriyeti', 205,    160,    32842)
 ('İtalya', 192, 301230, 59715625) ('İsviçre', 177,  41290,  7301994)
 ('Lüksemburg', 173,   2586,   512000) ('Fransa', 111, 547030, 63601002)
 ('Avusturya',  97,  83858,  8169929)
 ('Yunanistan',  81, 131940, 11606813) ('İrlanda',  65,  70280,  4581269)
 ('İsveç',  20, 449964,  9515744) ('Finlandiya',  16, 338424,  5410233)
 ('Norveç',  13, 385252,  5033675)]
__________________________________________________
('Hollanda', 393, 41526, 16928800)
('Belçika', 337, 30510, 11007020)
('Birleşik Krallık', 256, 243610, 62262000)
('Almanya', 233, 357021, 81799600)
('Leh Cumhuriyeti', 205, 160, 32842)
('İtalya', 192, 301230, 59715625)
('İsviçre', 177, 41290, 7301994)
('Lüksemburg', 173, 2586, 512000)
('Fransa', 111, 547030, 63601002)
('Avusturya', 97, 83858, 8169929)
('Yunanistan', 81, 131940, 11606813)
('İrlanda', 65, 70280, 4581269)
('İsveç', 20, 449964, 9515744)
('Finlandiya', 16, 338424, 5410233)
('Norveç', 13, 385252, 5033675)
_____________________________________________________

Ülkeler          Nüfusu     Yüzölçümü NüfusYoğunluğu
----------------------------------------------------
Hollanda         16,928,800    41,526 407.67
Belçika          11,007,020    30,510 360.77
Birleşik Krallık 62,262,000   243,610 255.58
Almanya          81,799,600   357,021 229.12
Leh Cumhuriyeti      32,842       160 205.26
İtalya           59,715,625   301,230 198.24
İsviçre           7,301,994    41,290 176.85
Lüksemburg          512,000     2,586 197.99
Fransa           63,601,002   547,030 116.27
Avusturya         8,169,929    83,858  97.43
Yunanistan       11,606,813   131,940  87.97
İrlanda           4,581,269    70,280  65.19
İsveç             9,515,744   449,964  21.15
Finlandiya        5,410,233   338,424  15.99
Norveç            5,033,675   385,252  13.07
----------------------------------------------------
"""